import { IconTree } from 'react-icons';

const Menu: IconTree = {
  tag: 'svg',
  attr: {
    viewBox: '0 0 20 20',
    version: '1.1'
  },
  child: [
    {
      tag: 'title',
      attr: {},
      child: []
    },
    {
      tag: 'g',
      attr: {
        id: '🆒-Fill-Icons',
        stroke: 'none',
        strokeWidth: '1',
        fillRule: 'evenodd'
      },
      child: [
        {
          tag: 'g',
          attr: {
            id: 'Icons',
            transform: 'translate(-1641.000000, -422.000000)'
          },
          child: [
            {
              tag: 'g',
              attr: {
                id: 'Icons/Menu',
                transform: 'translate(1641.000000, 422.000000)'
              },
              child: [
                {
                  tag: 'rect',
                  attr: {
                    id: 'Shape',
                    opacity: '0',
                    x: '0',
                    y: '0',
                    width: '20',
                    height: '20'
                  },
                  child: null
                },
                {
                  tag: 'path',
                  attr: {
                    d:
                      'M16,14.5 C16.5522847,14.5 17,14.9477153 17,15.5 C17,16.0128358 16.6139598,16.4355072 16.1166211,16.4932723 L16,16.5 L4,16.5 C3.44771525,16.5 3,16.0522847 3,15.5 C3,14.9871642 3.38604019,14.5644928 3.88337887,14.5067277 L4,14.5 L16,14.5 Z M16,9.5 C16.5522847,9.5 17,9.94771525 17,10.5 C17,11.0128358 16.6139598,11.4355072 16.1166211,11.4932723 L16,11.5 L4,11.5 C3.44771525,11.5 3,11.0522847 3,10.5 C3,9.98716416 3.38604019,9.56449284 3.88337887,9.50672773 L4,9.5 L16,9.5 Z M16,4.5 C16.5522847,4.5 17,4.94771525 17,5.5 C17,6.01283584 16.6139598,6.43550716 16.1166211,6.49327227 L16,6.5 L4,6.5 C3.44771525,6.5 3,6.05228475 3,5.5 C3,4.98716416 3.38604019,4.56449284 3.88337887,4.50672773 L4,4.5 L16,4.5 Z',
                    id: 'Shape',
                    fillRule: 'nonzero'
                  },
                  child: null
                }
              ]
            }
          ]
        }
      ]
    }
  ]
};

export default Menu;
